Revit 2024 API
Transform1D Class
 An affine transform of 1D Euclidean space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public class Transform1D : IDisposable
Visual Basic
Public Class Transform1D _
	Implements IDisposable
Visual C++
public ref class Transform1D : IDisposable
Remarks
 An affine transform is a linear transform plus a translation (which may be zero). 1D space is tranformed according to the following formula: t -> A*t + B where A and B are constants. Some functions only accept certain kinds of transform (e.g., rigid motion, conformal, non-singular, etc.).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Transform1D
See Also
Transform1D Members
Autodesk.Revit.DB Namespace